@menu
* Definiciones para stirling::
@end menu

@node Definiciones para stirling,  , stirling, stirling
@section Definiciones para stirling


@deffn {Funci@'on} stirling (@var{z},@var{n})
Sustituye @code{gamma(x)} por la f@'ormula de Stirling @math{O(1/x^(2n-1))}.
Si @var{n} no es un entero no negativo, emite un mensaje de error.

Referencia: Abramowitz & Stegun, " Handbook of mathematical functions", 6.1.40.

Ejemplos:
@example
(%i1) load (stirling)$

(%i2) stirling(gamma(%alpha+x)/gamma(x),1);
       1/2 - x             x + %alpha - 1/2
(%o2) x        (x + %alpha)
                                   1           1
                            --------------- - ---- - %alpha
                            12 (x + %alpha)   12 x
                          %e
(%i3) taylor(%,x,inf,1);
                    %alpha       2    %alpha
          %alpha   x       %alpha  - x       %alpha
(%o3)/T/ x       + -------------------------------- + . . .
                                 2 x
(%i4) map('factor,%);
                                       %alpha - 1
         %alpha   (%alpha - 1) %alpha x
(%o4)   x       + -------------------------------
                                  2
@end example

La funci@'on @code{stirling} conoce la diferencia existente entre
la variable 'gamma' y la funci@'on gamma:

@example
(%i5) stirling(gamma + gamma(x),0);
                                    x - 1/2   - x
(%o5)    gamma + sqrt(2) sqrt(%pi) x        %e
(%i6) stirling(gamma(y) + gamma(x),0);
                         y - 1/2   - y
(%o6) sqrt(2) sqrt(%pi) y        %e
                                              x - 1/2   - x
                         + sqrt(2) sqrt(%pi) x        %e
@end example

Antes de hacer uso de esta funci@'on ejec@'utese  @code{load("stirling")}.
@end deffn

