@c Language: Brazilian Portuguese, Encoding: iso-8859-1
@c /cholesky.texi/1.1/Mon Feb 27 22:09:17 2006//
@menu
* Defini@value{cedilha}@~oes para cholesky::
@end menu

@node Defini@value{cedilha}@~oes para cholesky,  , cholesky, cholesky
@section Defini@value{cedilha}@~oes para cholesky

@deffn {Fun@value{cedilha}@~ao} cholesky (@var{A})
Calcula a decomposi@,{c}@~ao de Cholesky de @var{A},
uma matriz triangular baixa @var{L} tal que @code{L . transpose(L) = A}.

Segue-se alguns exemplos.

Exemplo 1:
@example
(%i1) load("cholesky")$

(%i2) A : matrix ([a, b, c], [d, e, f], [g, h, i]);
                        [ a  b  c ]
                        [         ]
(%o2)                   [ d  e  f ]
                        [         ]
                        [ g  h  i ]
(%i3) A2 : transpose (A) . A;
      [   2    2    2                                     ]
      [  g  + d  + a     g h + d e + a b  g i + d f + a c ]
      [                                                   ]
(%o3) [                    2    2    2                    ]
      [ g h + d e + a b   h  + e  + b     h i + e f + b c ]
      [                                                   ]
      [                                     2    2    2   ]
      [ g i + d f + a c  h i + e f + b c   i  + f  + c    ]
(%i4) B : cholesky (A2)$

(%i5) B . transpose (B) - A2;
                        [ 0  0  0 ]
                        [         ]
(%o5)                   [ 0  0  0 ]
                        [         ]
                        [ 0  0  0 ]
@end example

Exemplo 2:
@example
(%i6) A : matrix ([2, 3, 4], [-2, 2,- 3], [11, -2, 3]);
                    [  2    3    4  ]
                    [               ]
(%o6)               [ - 2   2   - 3 ]
                    [               ]
                    [ 11   - 2   3  ]
(%i7) A2 : transpose (A) . A;
                    [ 129   - 20  47 ]
                    [                ]
(%o7)               [ - 20   17   0  ]
                    [                ]
                    [  47    0    34 ]
(%i8) B : cholesky (A2);
       [  sqrt(129)         0             0      ]
       [                                         ]
       [      20        sqrt(1793)               ]
       [ - ---------    ----------        0      ]
(%o8)  [   sqrt(129)    sqrt(129)                ]
       [                                         ]
       [     47       940 sqrt(129)      153     ]
       [  ---------   --------------  ---------- ]
       [  sqrt(129)   129 sqrt(1793)  sqrt(1793) ]
(%i9) B . transpose (B) - A2;
                       [ 0  0  0 ]
                       [         ]
(%o9)                  [ 0  0  0 ]
                       [         ]
                       [ 0  0  0 ]
@end example

Para usar essa fun@,{c}@~ao escreva primeiramente @code{load("cholesky")}.
@end deffn
