@menu
* Introduction to Sets::       
* Definitions for Sets::       
@end menu

@node Introduction to Sets, Definitions for Sets, Sets, Sets
@section Introduction to Sets

The @emph{nset} package provides set functions, such as intersection and 
union, for finite sets that are defined by explicit enumeration.
@emph{nset} treats 
lists and sets as distinct objects. This feature makes it possible to
work with sets that have members that are either lists or sets.

In addition to functions for finite sets, @emph{nset} provides some
functions related to combinatorics; these include the Stirling
numbers, the Bell numbers, and several others.

@c THIS DOCUMENT SHOULD MENTION nset-init.lisp AND test-nset.mac IN SOME WAY

@c This will create a directory @emph{nset-x} (again x is the release identifier)
@c that contains the source file @emph{nset.lisp}, user documentation in html 
@c and texi formats, a sample maxima initialization file @emph{nset-init.lisp}, 
@c a README file, and a testing  routine @emph{test-nset.mac}.

@c FOLLOWING TEXT LIKELY OBSOLETE NOW THAT nset.lisp IS IN src/, PRESERVE PENDING FINAL DETERMINATION

@c If you are using Maxima version 5.9.0 or higher, finish the installation
@c by appending the contents of @emph{nset-init.lisp} to your own
@c @emph{maxima-init.lisp} file. The Lisp file @emph{nset-init.lisp} 
@c contains replacements for the Maxima functions @emph{setup_autoload}
@c and @emph{generic_autoload}. Unlike Maxima's @emph{setup_autoload} function,
@c the version in @emph{nset-init.lisp} uses @emph{file_search}. Without this
@c change, a full pathname must be given to @emph{setup_autoload}. The
@c autoload function in Maxima 5.9.0 and lower does not recognize some
@c file extensions, such as .x86f and .fasl, as valid extensions for
@c compiled code. The version of @emph{generic_autoload} in @emph{nset-init}
@c fixes this problem. Additionally, @emph{nset-init.lisp} contains 
@c autoload statements for all user-level functions in @emph{nset}.

@c NEED TO MOVE test-nset.mac TO tests/

@c Once @emph{nset} is installed, run its testing code. Do this from a Maxima 
@c prompt using the command
@c @example
@c (C1) batch("test-nset.mac",'test);
@c @end example
@c You may need to use the full pathname for the file. The test should 
@c end with the statement
@c @example
@c ..Which was correct
@c Congratulations: No differences!
@c @end example
@c Please report any errors to the Maxima list.

@subsubsection Usage

To construct a set with members @emph{a1,a2,...,an}, use the
command @emph{set(a1,a2,...,an)}; to construct the empty
set, use @emph{set()}.  If a member is listed more than
once, the simplification process eliminates the redundant member.

@c ===beg===
@c set();
@c set(a, b, a);
@c set(a, set(b));
@c set(a, [b]);
@c ===end===
@example
(%i1) set();
(%o1)                          @{@}
(%i2) set(a, b, a);
(%o2)                        @{a, b@}
(%i3) set(a, set(b));
(%o3)                       @{a, @{b@}@}
(%i4) set(a, [b]);
(%o4)                       @{a, [b]@}
@end example

Sets are displayed as brace delimited lists; if you would like to
be able to  @emph{input} a set using braces, see the section 
@emph{Defining sets with braces}.

To construct a set from the elements of a list, use  @emph{setify}

@c ===beg===
@c setify([b, a]);
@c ===end===
@example
(%i1) setify([b, a]);
(%o1)                        @{a, b@}
@end example

Set members @emph{x} and @emph{y} are equal provided @emph{is(x = y)} 
evaluates to true. Thus @emph{rat(x)} and @emph{x} are equal as set members;
consequently, 

@c ===beg===
@c set(x, rat(x));
@c ===end===
@example
(%i1) set(x, rat(x));
(%o1)                          @{x@}
@end example

Further, since @emph{is((x-1)*(x+1) = x^2 - 1)} evaluates to false, 
@emph{(x-1)*(x+1)} and @emph{x^2-1} are distinct set members; thus 

@c ===beg===
@c set((x - 1)*(x + 1), x^2 - 1);
@c ===end===
@example
(%i1) set((x - 1)*(x + 1), x^2 - 1);
                                       2
(%o1)               @{(x - 1) (x + 1), x  - 1@}
@end example

To reduce this set to a singleton set, apply @emph{rat} to each set member:

@c ===beg===
@c set((x - 1)*(x + 1), x^2 - 1);
@c map(rat, %);
@c ===end===
@example
(%i1) set((x - 1)*(x + 1), x^2 - 1);
                                       2
(%o1)               @{(x - 1) (x + 1), x  - 1@}
(%i2) map(rat, %);
                              2
(%o2)/R/                    @{x  - 1@}
@end example

To remove redundancies from other sets, you may need to use other
simplification functions.  Here is an example that uses @emph{trigsimp}:

@c ===beg===
@c set(1, cos(x)^2 + sin(x)^2);
@c map(trigsimp, %);
@c ===end===
@example
(%i1) set(1, cos(x)^2 + sin(x)^2);
                            2         2
(%o1)                @{1, sin (x) + cos (x)@}
(%i2) map(trigsimp, %);
(%o2)                          @{1@}
@end example

A set is simplified when its members are non-redundant and
sorted. The current version of @emph{nset} uses the Maxima function
@emph{orderlessp} to order sets; however, @emph{future versions of 
@emph{nset} might use a different ordering function.  
Robust application code that uses nset must not depend on a 
particular ordering.}

Some operations on sets, such as substitution, automatically force a 
re-simplification; for  example,

@c ===beg===
@c s: set (a, b, c)$
@c subst (c=a, s);
@c subst ([a=x, b=x, c=x], s);
@c map (lambda ([x], x^2), set (-1, 0, 1));
@c ===end===
@example
(%i1) s: set (a, b, c)$
(%i2) subst (c=a, s);
(%o2)                        @{a, b@}
(%i3) subst ([a=x, b=x, c=x], s);
(%o3)                          @{x@}
(%i4) map (lambda ([x], x^2), set (-1, 0, 1));
(%o4)                        @{0, 1@}
@end example

@c NAME HERE ANY FUNCTIONS WHICH AUTOMATICALLY COERCE SETS TO LISTS OR VV
The @emph{nset} package treats lists and sets as distinct objects;
functions such as @emph{union} and @emph{intersection} will signal
an error if any argument is a list.  If you need to apply a set
function to a list, use the @emph{setify} function to convert it
to a set.  Thus

@c ===beg===
@c union ([1, 2], set (a, b));
@c union (setify ([1, 2]), set (a, b));
@c ===end===
@example
(%i1) union ([1, 2], set (a, b));
Function union expects a set, instead found [1,2]
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i2) union (setify ([1, 2]), set (a, b));
(%o2)                     @{1, 2, a, b@}
@end example

To extract all set elements of a set @emph{s} that satisfy a predicate
@emph{f}, use @emph{subset(s,f)}. (In  Maxima, a @emph{predicate} is a 
boolean-valued function.) For example, to find the equations 
in a given set that do not depend on a variable @emph{z}, use

@c ===beg===
@c subset (set (x + y + z, x - y + 4, x + y - 5), lambda ([e], freeof (z, e)));
@c ===end===
@example
(%i1) subset (set (x + y + z, x - y + 4, x + y - 5), lambda ([e], freeof (z, e)));
(%o1)               @{- y + x + 4, y + x - 5@}
@end example

The section @emph{Definitions for Sets} has a complete list of
the functions in @emph{nset}.

@subsubsection Set Member Iteration

There two ways to to iterate over set members.  One way is the use
@emph{map}; for example

@c ===beg===
@c map (f, set (a, b, c));
@c ===end===
@example
(%i1) map (f, set (a, b, c));
(%o1)                  @{f(a), f(b), f(c)@}
@end example

The other way is to use @emph{for in do}

@c ===beg===
@c s: set (a, b, c);
@c for si in s do print (concat (si, 1));
@c ===end===
@example
(%i1) s: set (a, b, c);
(%o1)                       @{a, b, c@}
(%i2) for si in s do print (concat (si, 1));
a1 
b1 
c1 
(%o2)                         done
@end example

The Maxima functions @emph{first} and @emph{rest} work
correctly on sets.  Applied to a set, @emph{first} returns the first
displayed element of a set; which element that is may be
implementation-dependent. If @emph{s} is a set, then 
@emph{rest(s)} is equivalent to @emph{disjoin(first(s),s)}.  
Currently, there are other Maxima functions that work correctly
on sets; however, for future versions of @emph{nset}, they may function
differently or not at all.

@subsubsection Bugs
@c AT THIS POINT (2005/05) I DON'T KNOW IF IT'S NECESSARY TO GO INTO DETAILS
@c ABOUT BUGS IN MAXIMA REVISIONS 5.9.0 AND EARLIER

The @emph{nset} package uses the Maxima function @emph{orderlessp} to 
order set members and the (Lisp-level) function @emph{like} to test for set
member equality.  Both of these functions have known bugs (versions
5.9.0 and earlier) that may manifest if you attempt to use
sets with members that are lists or matrices that contain expressions
in CRE form. An example is

@c ===beg===
@c set ([x], [rat (x)]);
@c ===end===
@example
(%i1) set ([x], [rat (x)]);
Maxima encountered a Lisp error:

 CAR: #:X13129 is not a LIST

Automatically continuing.
To reenable the Lisp debugger set *debugger-hook* to nil.
@end example

This command causes Maxima to halt with an error (the error message
depends on which version of Lisp your Maxima uses). Another
example is

@c ===beg===
@c setify ([[rat(a)], [rat(b)]]);
@c ===end===
@example
(%i1) setify ([[rat(a)], [rat(b)]]);
Maxima encountered a Lisp error:

 CAR: #:A13129 is not a LIST

Automatically continuing.
To reenable the Lisp debugger set *debugger-hook* to nil.
@end example

These bugs are caused by bugs in @emph{orderlessp} and @emph{like}; they
are not caused by bugs in @emph{nset}. To illustrate, try the commands

@c ===beg===
@c orderlessp ([rat(a)], [rat(b)]);
@c is ([rat(a)] = [rat(a)]);
@c ===end===
@example
(%i1) orderlessp ([rat(a)], [rat(b)]);
Maxima encountered a Lisp error:

 CAR: #:B13130 is not a LIST

Automatically continuing.
To reenable the Lisp debugger set *debugger-hook* to nil.
(%i2) is ([rat(a)] = [rat(a)]);
(%o2)                         false
@end example

Until these bugs are fixed, do not construct sets with members that
are lists or matrices containing expressions in CRE form; a set with a 
member in CRE form, however, shouldn't be a problem

@c ===beg===
@c set (x, rat (x));
@c ===end===
@example
(%i1) set (x, rat (x));
(%o1)                          @{x@}
@end example

Maxima's @emph{orderlessp} has another bug that can cause problems
with @emph{nset } functions; the ordering predicate @emph{orderlessp} is
not transitive. The simplest known example that shows this is

@c ===beg===
@c q: x^2$
@c r: (x + 1)^2$
@c s: x*(x + 2)$
@c orderlessp (q, r);
@c orderlessp (r, s);
@c orderlessp (q, s);
@c ===end===
@example
(%i1) q: x^2$
(%i2) r: (x + 1)^2$
(%i3) s: x*(x + 2)$
(%i4) orderlessp (q, r);
(%o4)                         true
(%i5) orderlessp (r, s);
(%o5)                         true
(%i6) orderlessp (q, s);
(%o6)                         false
@end example

This bug can cause trouble will all @emph{nset} functions as well as with
Maxima functions in general. It's likely, but not certain, that 
if all set members are either in CRE form or have been simplified
using @emph{ratsimp}, this bug will not manifest.

Maxima's @emph{orderless} and @emph{ordergreat} mechanisms are 
incompatible with @math{nset}. If you need to use either @emph{orderless}
or @emph{ordergreat},  issue these commands before loading @emph{nset}
and do not use the @emph{unorder} command. 

You may encounter two other minor bugs while using @emph{nset}.
Maxima versions 5.5 and earlier had a bug in the @emph{tex} function that
makes the empty set incorrectly translate to TeX; this bug is fixed in
the Maxima 5.9.0. Additionally, the @emph{setup_autoload} function in
Maxima 5.9.0 is broken; a fix is in the @emph{nset-init.lisp} file
located in the @emph{nset} distribution.

Maxima's sign function has a bug that may cause the Kronecker
delta function to misbehave; for example

@c ===beg===
@c kron_delta (1/sqrt(2), sqrt(2)/2);
@c ===end===
@example
(%i1) kron_delta (1/sqrt(2), sqrt(2)/2);
(%o1)                           0
@end example

The correct value is 1; the bug is related to the @emph{sign} bug

@c ===beg===
@c sign (1/sqrt(2) - sqrt(2)/2);
@c ===end===
@example
(%i1) sign (1/sqrt(2) - sqrt(2)/2);
(%o1)                          pos
@end example

If you find something that you think might be a @emph{nset} bug, please 
report  it to the Maxima bug database.

@subsubsection Defining sets with braces

If you'd like to be able to input sets using braces, you may do
so by declaring the left brace to be a matchfix operator; this
is done using the commands

@c ===beg===
@c matchfix("{","}")$
@c "{" ([a]) := apply (set, a)$
@c ===end===
@example
(%i1) matchfix("@{","@}")$
(%i2) "@{" ([a]) := apply (set, a)$
@end example

Now we can define sets using braces; thus

@c ===beg===
@c matchfix("{","}")$
@c "{" ([a]) := apply (set, a)$
@c {};
@c {a, {a, b}};
@c ===end===
@example
(%i1) matchfix("@{","@}")$
(%i2) "@{" ([a]) := apply (set, a)$
(%i3) @{@};
(%o3)                          @{@}
(%i4) @{a, @{a, b@}@};
(%o4)                      @{a, @{a, b@}@}
@end example

To always allow this form of set input, place the two commands in lines 
(c1) and (c2) in your @emph{maxima-init.mac} file.

@subsubsection Combinatorial and Miscellaneous Functions

In addition to functions for finite sets, @emph{nset} provides some
functions related to combinatorics; these include the Stirling
numbers of the first and second kind, the Bell numbers, multinomial
coefficients, partitions of nonnegative integers, and a few others. 
The @emph{nset} package also defines a Kronecker delta function.


@subsubsection Authors

Stavros Macrakis of Cambridge, Massachusetts and Barton Willis of the
University of Nebraska at Kearney (UNK) wrote the nset package and its
documentation. 

@node Definitions for Sets,  , Introduction to Sets, Sets
@section Definitions for Sets

@anchor{adjoin}
@defun adjoin (x, a) 
Adjoin @emph{x} to the set @emph{a} and return a set. Thus @emph{adjoin(x,a)} 
and @emph{union(set(x),a)} are equivalent; however, using @emph{adjoin}
may be somewhat faster than using @emph{union}. If @emph{a} isn't a 
set, signal an error.

@c ===beg===
@c adjoin (c, set (a, b));
@c adjoin (a, set (a, b));
@c ===end===
@example
(%i1) adjoin (c, set (a, b));
(%o1)                       @{a, b, c@}
(%i2) adjoin (a, set (a, b));
(%o2)                        @{a, b@}
@end example

See also @math{disjoin}.
@end defun

@anchor{belln}
@defun belln (n)
For nonnegative integers @math{n}, return the n-th Bell number. If
@math{s} is a set with @math{n} members,  @math{belln(n)} is the number 
of partitions of @math{s}.  For example

@c ===beg===
@c makelist (belln (i), i, 0, 6);
@c is (cardinality (set_partitions (set ())) = belln (0));
@c is (cardinality (set_partitions (set (1, 2, 3, 4, 5, 6))) = belln (6));
@c ===end===
@example
(%i1) makelist (belln (i), i, 0, 6);
(%o1)               [1, 1, 2, 5, 15, 52, 203]
(%i2) is (cardinality (set_partitions (set ())) = belln (0));
(%o2)                         true
(%i3) is (cardinality (set_partitions (set (1, 2, 3, 4, 5, 6))) = belln (6));
(%o3)                         true
@end example

When @math{n} isn't a nonnegative integer, @math{belln(n)} doesn't
simplify

@c ===beg===
@c [belln (x), belln (sqrt(3)), belln (-9)];
@c ===end===
@example
(%i1) [belln (x), belln (sqrt(3)), belln (-9)];
(%o1)        [belln(x), belln(sqrt(3)), belln(- 9)]
@end example

The function @math{belln} threads over equalities, lists, matrices, and 
sets.
@end defun

@anchor{cardinality}
@defun cardinality (a)
Return the number of distinct elements of the set @emph{a}. 

@c ===beg===
@c cardinality (set ());
@c cardinality (set (a, a, b, c));
@c cardinality (set (a, a, b, c)), simp: false;
@c ===end===
@example
(%i1) cardinality (set ());
(%o1)                           0
(%i2) cardinality (set (a, a, b, c));
(%o2)                           3
(%i3) cardinality (set (a, a, b, c)), simp: false;
(%o3)                           3
@end example

In line (c3), we see that cardinality works correctly even when simplification
has been turned off. 
@end defun

@anchor{cartesian_product}
@defun cartesian_product (b1, b2, ... , bn)
Return a set of lists of the form @emph{[x1,...,xn]}, where
@emph{x1 in b1}, @emph{x2 in b2}, ..., and @emph{xn in bn}. 
Signal an error when any @emph{b} isn't a set.

@c ===beg===
@c cartesian_product (set (0, 1));
@c cartesian_product (set (0, 1), set (0, 1));
@c cartesian_product (set (x), set (y), set (z));
@c cartesian_product (set (x), set (-1, 0, 1));
@c ===end===
@example
(%i1) cartesian_product (set (0, 1));
(%o1)                      @{[0], [1]@}
(%i2) cartesian_product (set (0, 1), set (0, 1));
(%o2)           @{[0, 0], [0, 1], [1, 0], [1, 1]@}
(%i3) cartesian_product (set (x), set (y), set (z));
(%o3)                      @{[x, y, z]@}
(%i4) cartesian_product (set (x), set (-1, 0, 1));
(%o4)              @{[x, - 1], [x, 0], [x, 1]@}
@end example
@end defun


@anchor{disjoin}
@defun disjoin (x a)
Remove @math{x} from the set @math{a} and return a @emph{set}. 
If @math{x} isn't a member of @math{a}, return @math{a}. Each of the 
following do the same thing: @math{disjoin(x,a)}, @math{delete(x,a)}, and
@math{setdifference(a,set(x))}; however, @math{disjoin} is generally
the fastest way to remove a member from a set.
Signal an error if @math{a} isn't a set.
@end defun

@anchor{disjointp}
@defun disjointp (a, b) 
Return @emph{true} if the sets @emph{a} and @emph{b} are disjoint. Signal an 
error if either @emph{a} or @emph{b} isn't a set.
@end defun

@anchor{divisors}
@defun divisors (n)
When @emph{n} is a nonzero integer, return the set of its divisors. 
The set of divisors includes the members @emph{1} and @emph{n}.
The divisors of a  negative integer are the divisors of its absolute value.

We can show that 28 is a perfect number using

@c ===beg===
@c s: divisors(28);
@c lreduce ("+", args(s)) - 28;
@c ===end===
@example
(%i1) s: divisors(28);
(%o1)                 @{1, 2, 4, 7, 14, 28@}
(%i2) lreduce ("+", args(s)) - 28;
(%o2)                          28
@end example

The function divisors works by simplification; you shouldn't need to
manually re-evaluate after a substitution. For example

@c ===beg===
@c divisors (a);
@c subst (8, a, %);
@c ===end===
@example
(%i1) divisors (a);
(%o1)                      divisors(a)
(%i2) subst (8, a, %);
(%o2)                     @{1, 2, 4, 8@}
@end example

The function divisors threads over equalities, lists, matrices, and 
sets. Here is an example of threading over a list and an equality.

@c ===beg===
@c divisors ([a, b, c=d]);
@c ===end===
@example
(%i1) divisors ([a, b, c=d]);
(%o1) [divisors(a), divisors(b), divisors(c) = divisors(d)]
@end example
@end defun

@anchor{elementp}
@defun elementp (x, a)          
Return @emph{true} if and only if  @emph{x} is a member of the 
set @emph{a}.  Signal an error if @emph{a} isn't a set.  
@end defun

@anchor{emptyp}
@defun emptyp (a)
Return @emph{true} if and only if @emph{a} is the empty set or
the empty list.

@c ===beg===
@c map (emptyp, [set (), []]);
@c map (emptyp, [a + b, set (set ()), %pi]);
@c ===end===
@example
(%i1) map (emptyp, [set (), []]);
(%o1)                     [true, true]
(%i2) map (emptyp, [a + b, set (set ()), %pi]);
(%o2)                 [false, false, false]
@end example
@end defun
       
@anchor{equiv_classes}
@defun equiv_classes (s,f)
Return a set of the equivalence classes of @emph{s} with respect
to the equivalence relation @emph{f}. The function @emph{f} should
be a boolean-valued function defined on the cartesian product
of @emph{s} with @emph{s}. Further, the function @emph{f} should 
be an equivalence relation; @emph{equiv_classes}, however, doesn't 
check that it is. 

@c ===beg===
@c equiv_classes (set (a, b, c), lambda ([x, y], is (x=y)));
@c ===end===
@example
(%i1) equiv_classes (set (a, b, c), lambda ([x, y], is (x=y)));
(%o1)                    @{@{a@}, @{b@}, @{c@}@}
@end example

Actually, @emph{equiv_classes(s,f)} automatically applies the Maxima 
function @emph{is} after applying the function @emph{f}; accordingly,
we can re-work the previous example with the command

@c ===beg===
@c equiv_classes (set (a, b, c), "=");
@c ===end===
@example
(%i1) equiv_classes (set (a, b, c), "=");
(%o1)                    @{@{a@}, @{b@}, @{c@}@}
@end example

Here is another example

@c ===beg===
@c equiv_classes (set (1, 2, 3, 4, 5, 6, 7), lambda ([x, y], remainder (x - y, 3) = 0));
@c ===end===
@example
(%i1) equiv_classes (set (1, 2, 3, 4, 5, 6, 7), lambda ([x, y], remainder (x - y, 3) = 0));
(%o1)              @{@{1, 4, 7@}, @{2, 5@}, @{3, 6@}@}
@end example
@end defun

@anchor{every}
@defun every (f, set(a1,...,an) | [a11,...,a1n],[a21,...],...)

The first argument @math{f} should be a predicate (a function that evaluates to
true, false, or unknown). 

Given one set as the second  argument, 
@math{every(f, set(a1,...,an))} returns @math{true} if any f(ai) evaluates to true.
Since sets are unordered, 'every' is free to evaluate f(ai) in any
order.   'Every' may or may not evaluate all the f(ai)'s. Because the
order of  evaluation isn't specified, the predicate @math{f} should
not have side-effects or signal errors for any input. 
To use  'every' on multiple set arguments, they should first be converted
to an ordered  sequence so that their relative alignment becomes well-defined.

Given one or more lists as arguments,
@math{every(f,[a11,...,a1n],[a21,...],...)} evaluates to true if  any f(ai1,ai2,...)
evaluates to true. 'Every' may or may not evaluate all the
f(ai1,ai2,...)'s.  Since  lists are ordered, 'every' evaluates in the order of increasing 'i'.
If the global flag maperror is true (the default), all lists 
@math{[a11,..a1n], [a21,..], ...} must have equal lengths -- otherwise, 'every' signals an error.
When the Maxima flag $maperror is false, the list arguments are
effectively truncated each to the length of the shortest list. 

The Maxima function 'is' automatically applied after evaluating the
predicate @math{f}; thus the following work correctly

@c ===beg===
@c every ("=", [a, b], [a, b]);
@c every ("#", [a, b], [a, b]);
@c ===end===
@example
(%i1) every ("=", [a, b], [a, b]);
(%o1)                         true
(%i2) every ("#", [a, b], [a, b]);
(%o2)                         false
@end example
@end defun
 
@anchor{extremal_subset}
@defun extremal_subset (s,f,[max,min])
When the third argument is max, return the subset of the set or 
list @emph{s} for which the real-valued function @emph{f} takes 
on its greatest value; when the third argument is min, return the 
subset for which @emph{f} takes on its least value.

@c ===beg===
@c extremal_subset (set (-2, -1, 0, 1, 2), abs, max);
@c extremal_subset (set (sqrt(2), 1.57, %pi/2), sin, min);
@c ===end===
@example
(%i1) extremal_subset (set (-2, -1, 0, 1, 2), abs, max);
(%o1)                       @{- 2, 2@}
(%i2) extremal_subset (set (sqrt(2), 1.57, %pi/2), sin, min);
(%o2)                       @{sqrt(2)@}
@end example
@end defun

@anchor{flatten}
@defun flatten (e)
Flatten essentially evaluates an  expression as if its main operator had 
been declared nary; there is, however, one difference -- flatten doesn't 
recurse into other function arguments.  Consider

@c ===beg===
@c expr: flatten (f (g (f (f (x)))));
@c declare (f, nary);
@c ev (expr);
@c ===end===
@example
(%i1) expr: flatten (f (g (f (f (x)))));
(%o1)                     f(g(f(f(x))))
(%i2) declare (f, nary);
(%o2)                         done
(%i3) ev (expr);
(%o3)                      f(g(f(x)))
@end example

Applied to a set, flatten gathers all members of set elements that
are sets; for example

@c ===beg===
@c flatten (set (a, set (b), set (set (c))));
@c flatten (set (a, set ([a], set (a))));
@c ===end===
@example
(%i1) flatten (set (a, set (b), set (set (c))));
(%o1)                       @{a, b, c@}
(%i2) flatten (set (a, set ([a], set (a))));
(%o2)                       @{a, [a]@}
@end example

Flatten works correctly when the main operator is a subscripted function

@c ===beg===
@c flatten (f[5] (f[5] (x)));
@c ===end===
@example
(%i1) flatten (f[5] (f[5] (x)));
(%o1)                         f (x)
                               5
@end example

To flatten an expression, the main operator must be defined for zero or 
more arguments;  if this isn't the case, Maxima will halt with an error. 
Expressions with special representations, for example CRE expressions, 
can't be flattened; in this case, flatten returns its argument
unchanged.
@end defun

@anchor{full_listify}
@defun full_listify (a)
Convert @emph{every} set in the expression @emph{a} into a list.
To convert just the top-level operator of a set to a list,
see @ref{listify}.
@end defun

@anchor{fullsetify}
@defun fullsetify (a)
If @emph{a} is a list, convert @emph{a} to a set and apply 
@emph{fullsetify} to each set member. 

@c ===beg===
@c fullsetify ([a, [a]]);
@c fullsetify ([a, f([b])]);
@c ===end===
@example
(%i1) fullsetify ([a, [a]]);
(%o1)                       @{a, @{a@}@}
(%i2) fullsetify ([a, f([b])]);
(%o2)                      @{a, f([b])@}
@end example

In line (C2), the argument of @emph{f} isn't converted to a set
because the main operator of @emph{f([b])} isn't a list.

To convert just the top-level operator of a list to a set, see
@ref{setify}.
@end defun

@anchor{identity}
@defun identity (x)

The identity function evaluates to its argument for all inputs.  To 
determine if every member of a set is @math{true}, you can use

@c ===beg===
@c every (identity, [true, true]);
@c ===end===
@example
(%i1) every (identity, [true, true]);
(%o1)                         true
@end example
@end defun

@anchor{integer_partitions}
@defun integer_partitions (n, {len})
If the optional second argument @emph{len} isn't specified, return the set of
all partitions of the integer @math{n}.  When @math{len} is specified,
return all partitions that have length @math{len} or less; in this
case, zeros are appended to each partition with fewer than @math{len}
terms to make each partition have exactly @math{len} terms.  In either
case, each partition is a list sorted from greatest to least.

We say  a list @math{[a1,a2,...,am]} is a partition of a nonnegative integer
@math{n} provided (i) each @math{ai} is a nonzero integer and (ii) 
@math{a1 + a2 + ... + am  = n.}  Thus 0 has no partitions.  

@c ===beg===
@c integer_partitions (3);
@c s: integer_partitions (25)$
@c cardinality (s);
@c map (lambda ([x], apply ("+", x)), s);
@c integer_partitions (5, 3);
@c integer_partitions (5, 2);
@c ===end===
@example
(%i1) integer_partitions (3);
(%o1)               @{[1, 1, 1], [2, 1], [3]@}
(%i2) s: integer_partitions (25)$
(%i3) cardinality (s);
(%o3)                         1958
(%i4) map (lambda ([x], apply ("+", x)), s);
(%o4)                         @{25@}
(%i5) integer_partitions (5, 3);
(%o5) @{[2, 2, 1], [3, 1, 1], [3, 2, 0], [4, 1, 0], [5, 0, 0]@}
(%i6) integer_partitions (5, 2);
(%o6)               @{[3, 2], [4, 1], [5, 0]@}
@end example

To find all partitions that satisfy a condition, use the function @math{subset};
here is an example that finds all partitions of 10 that consist of prime numbers

@c ===beg===
@c s: integer_partitions (10)$
@c xprimep(x) := integerp(x) and (x > 1) and primep(x)$
@c subset (s, lambda ([x], every (xprimep, x)));
@c ===end===
@example
(%i1) s: integer_partitions (10)$
(%i2) xprimep(x) := integerp(x) and (x > 1) and primep(x)$
(%i3) subset (s, lambda ([x], every (xprimep, x)));
(%o3) @{[2, 2, 2, 2, 2], [3, 3, 2, 2], [5, 3, 2], [5, 5], [7, 3]@}
@end example

@c SEE SF BUG REPORT # 779053
(Notice that @math{primep(1)} is true in Maxima. This disagrees with
most definitions of prime.)
@end defun

@c intersect IS AN ALIAS FOR intersection -- JUST REFER TO THE LATTER HERE
@anchor{intersect}
@defun intersect (a1,a2,...,an)
Return a set containing  the elements that are common to the
sets @emph{a1} through @emph{an}. The function @emph{intersect}
must receive one or more arguments. Signal an error if any of
@emph{a1} through @emph{an} isn't a set.  See also @ref{intersection}.
@end defun

@anchor{intersection}
@defun intersection (a1,a2,...,an)
Return a set containing  the elements that are common to the 
sets @emph{a1} through @emph{an}. The function @emph{intersection}
must receive one or more arguments. Signal an error if any of
@emph{a1} through @emph{an} isn't a set.  See also @ref{intersect}.
@end defun

@defun kron_delta (i, j)
The Kronecker delta function; @math{kron_delta(i,j)} simplifies to
1 when @math{is(i = j)} is true and it simplifies to zero when 
@math{sign(|i - j|)} is @emph{pos}.  When @math{sign|i-j|} is zero
and @math{i-j} isn't a floating point number (either a double or
a bfloat), return 0. Otherwise, return a noun form.

The function, @emph{kron_delta} is declared to be 
symmetric; thus, for example, @emph{kron_delta(i,j) - kron_delta(j,i)} 
evaluates to zero.

Here are a few examples,

@c ===beg===
@c [kron_delta (a, a), kron_delta (a + 1, a)];
@c kron_delta (a, b);
@c ===end===
@example
(%i1) [kron_delta (a, a), kron_delta (a + 1, a)];
(%o1)                        [1, 0]
(%i2) kron_delta (a, b);
(%o2)                   kron_delta(a, b)
@end example

Assuming that @math{a > b} makes @math{sign(|a-b|)} evaluate to @math{pos};
thus

@c ===beg===
@c assume (a > b)$
@c kron_delta (a, b);
@c ===end===
@example
(%i1) assume (a > b)$
(%i2) kron_delta (a, b);
(%o2)                           0
@end example

If we instead assume that @math{x >= y}, then @math{sign(|x-y|)} evaluates
to @math{pz}; in this case, @math{kron_delta(x,y)} doesn't simplify

@c ===beg===
@c assume(x >= y)$
@c kron_delta (x, y);
@c ===end===
@example
(%i1) assume(x >= y)$
(%i2) kron_delta (x, y);
(%o2)                   kron_delta(x, y)
@end example

Finally, since @emph{1/10 - 0.1} evaluates to a floating point
number, we have 

@c ===beg===
@c kron_delta (1/10, 0.1);
@c ===end===
@example
(%i1) kron_delta (1/10, 0.1);
                                  1
(%o1)                  kron_delta(--, 0.1)
                                  10
@end example

If you want (D7) to evaluate to 1, apply @math{float}

@c ===beg===
@c float (kron_delta (1/10, 0.1));
@c ===end===
@example
(%i1) float (kron_delta (1/10, 0.1));
(%o1)                           1
@end example
@end defun

@anchor{listify}
@defun listify (a)
If @emph{a} is a set, return a list containing the members of @emph{a};
when @emph{a} isn't a set, return @emph{a}.  To convert a set and all
of its members to lists, see @ref{full_listify}

@c NEED TO PUT SOMETHING HERE
@c ===beg===
@c ===end===
@example
@end example
@end defun

@anchor{lreduce}
@defun lreduce (f, s, @{init@})
The function @math{lreduce} (left reduce) extends a 2-arity 
function to an n-arity function by composition; an example should 
make this clear. When the optional argument @math{init} isn't defined, we have

@c ===beg===
@c lreduce (f, [1, 2, 3]);
@c lreduce (f, [1, 2, 3, 4]);
@c ===end===
@example
(%i1) lreduce (f, [1, 2, 3]);
(%o1)                     f(f(1, 2), 3)
(%i2) lreduce (f, [1, 2, 3, 4]);
(%o2)                  f(f(f(1, 2), 3), 4)
@end example

Notice that the function @math{f} is first applied to the
@emph{leftmost} list elements (thus the name lreduce). 
When @math{init} is defined, the second argument to the inner most function 
evaluation is @math{init}; for example

@c ===beg===
@c lreduce (f, [1, 2, 3], 4);
@c ===end===
@example
(%i1) lreduce (f, [1, 2, 3], 4);
(%o1)                  f(f(f(4, 1), 2), 3)
@end example

The function @math{lreduce} makes it easy to find the product or
sum of the elements of a list

@c ===beg===
@c lreduce ("+", args (set (a, b)));
@c lreduce ("*", args (set (1, 2, 3, 4, 5)));
@c ===end===
@example
(%i1) lreduce ("+", args (set (a, b)));
(%o1)                         b + a
(%i2) lreduce ("*", args (set (1, 2, 3, 4, 5)));
(%o2)                          120
@end example

See also @math{rreduce}, @math{xreduce}, and @math{tree_reduce}
@end defun

@anchor{makeset}
@defun makeset (e, v, s)
This function is similar to @emph{makelist}, but @emph{makeset} allows
multiple substitutions. The first argument @math{e} is an expression; the
second argument @math{v} is a list of variables; and @math{s} is a list or 
set of values for the variables @math{v}. Each member of @math{s} must
have the same length as @math{v}. We have @math{makeset(e,v,s) = {z | 
z = substitute(v -> si) and si in s}}.

@c ===beg===
@c makeset (i/j, [i, j], [[a, b], [c, d]]);
@c ind: set (0, 1, 2, 3)$
@c makeset (i^2 + j^2 + k^2, [i, j, k], cartesian_product (ind, ind, ind));
@c ===end===
@example
(%i1) makeset (i/j, [i, j], [[a, b], [c, d]]);
                              a  c
(%o1)                        @{-, -@}
                              b  d
(%i2) ind: set (0, 1, 2, 3)$
(%i3) makeset (i^2 + j^2 + k^2, [i, j, k], cartesian_product (ind, ind, ind));
(%o3) @{0, 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 17, 18, 
                                                      19, 22, 27@}
@end example
@end defun

@anchor{moebius}
@defun moebius (n)
The Moebius function; when @math{n} is product of @math{k} distinct
primes, @emph{moebius(n)} evaluates to @math{(-1)^k}; it evaluates to 1 when
@math{n = 1}; and it evaluates to 0 for all other positive integers. 
The Moebius function threads over equalities, lists, matrices, and 
sets.
@end defun
 
@anchor{multinomial_coeff}
@defun multinomial_coeff ({a1,a2, ..., an})
Return the multinomial coefficient.  When each @math{ak} is
a nonnegative integer, the multinomial coefficient
gives the number of ways of placing @math{a1 + a2 + ... + an} 
distinct objects into @math{n} boxes with @math{ak} elements in the 
@emph{k-th} box. In general, @math{multinomial(a1,a2,...,an)}
evaluates to @math{(a1+a2+...+an)!/(a1! a2! ... an!)}. Given no
arguments, @math{multinomial()} evaluates to 1. A user may use
@math{minfactorial} to simplify the value returned by @math{multinomial_coeff};
for example

@c ===beg===
@c multinomial_coeff (1, 2, x);
@c minfactorial (%);
@c multinomial_coeff (-6, 2);
@c minfactorial (%);
@c ===end===
@example
(%i1) multinomial_coeff (1, 2, x);
                            (x + 3)!
(%o1)                       --------
                              2 x!
(%i2) minfactorial (%);
                     (x + 1) (x + 2) (x + 3)
(%o2)                -----------------------
                                2
(%i3) multinomial_coeff (-6, 2);
                             (- 4)!
(%o3)                       --------
                            2 (- 6)!
(%i4) minfactorial (%);
(%o4)                          10
@end example
@end defun

@anchor{num_distinct_partitions}
@defun num_distinct_partitions (n, {a})

When @emph{n} is a nonnegative integer, return the number of 
distinct integer partitions of @emph{n}.

If the optional parameter @emph{a} has the value "list", return a 
list of the number of distinct partitions of 1,2,3, ... , n. 
If @emph{n} isn't a nonnegative integer, return a noun form.

Definition: If @math{n = k1 + k2 + ... + km}, where @math{k1} 
through @math{km}  are distinct positive integers, we call 
@math{k1 + k2 + ... + km}  a distinct partition of @math{n}.
@end defun

@anchor{num_partitions}
@defun num_partitions (n, {a})
When @emph{n} is a nonnegative integer, return the number of partitions 
of @emph{n}. If the optional parameter @emph{a} has the value "list", 
return a list of the number of partitions of 1,2,3, ... , n.  If @emph{n} 
isn't a nonnegative integer, return a noun form.

@c ===beg===
@c num_partitions (5) = cardinality (integer_partitions (5));
@c num_partitions (8, list);
@c num_partitions (n);
@c ===end===
@example
(%i1) num_partitions (5) = cardinality (integer_partitions (5));
(%o1)                         7 = 7
(%i2) num_partitions (8, list);
(%o2)            [1, 1, 2, 3, 5, 7, 11, 15, 22]
(%i3) num_partitions (n);
(%o3)                   num_partitions(n)
@end example

For a nonnegative integer, we should have @math{num_partitions(n) =
cardinality(integer_partitions(n))}; however, using @math{num_partitions} 
is much faster.
@end defun



@anchor{partition_set}
@defun partition_set (a,f)
Return a list of two sets; the first set is the subset of @emph{a} for which
the predicate @emph{f} evaluates to false and the second is the subset of 
@emph{a} for which @emph{f} evaluates to true.
If @emph{a} isn't a set, signal an error.
See also @ref{subset}.

@c ===beg===
@c partition_set (set (2, 7, 1, 8, 2, 8), evenp);
@c partition_set (set (x, rat(y), rat(y) + z, 1), lambda ([x], ratp(x)));
@c ===end===
@example
(%i1) partition_set (set (2, 7, 1, 8, 2, 8), evenp);
(%o1)                   [@{1, 7@}, @{2, 8@}]
(%i2) partition_set (set (x, rat(y), rat(y) + z, 1), lambda ([x], ratp(x)));
(%o2)/R/              [@{1, x@}, @{y, y + z@}]
@end example
@end defun

@anchor{permutations}
@defun permutations (a)
Return a @emph{set} of all @emph{distinct} permutations of the members of 
the list or set @emph{a}. (Each permutation is a list, not a set.) 
When @emph{a} is a list, duplicate members of @emph{a} are @emph{not} deleted 
before finding the permutations. Thus

@c ===beg===
@c permutations ([a, a]);
@c permutations ([a, a, b]);
@c ===end===
@example
(%i1) permutations ([a, a]);
(%o1)                       @{[a, a]@}
(%i2) permutations ([a, a, b]);
(%o2)           @{[a, a, b], [a, b, a], [b, a, a]@}
@end example

If @emph{a} isn't a list or set, signal an error.
@end defun

@anchor{powerset}
@defun powerset (a,{n})
When the optional second argument @math{n} isn't defined, return the set 
of all subsets of the set @emph{a}. If @emph{a} has @emph{n} elements, 
@math{powerset(a)} has @emph{2^n} members.  Given a second argument,
@math{powerset(a,n)} returns the set of all subsets of @emph{a} that have 
cardinality @emph{n}. Signal an error if @emph{a} isn't a set;
additionally signal an error if @math{n} isn't a positive integer.
@end defun

@anchor{rreduce}
@defun rreduce (f, s, @{init@})
The function @math{rreduce} (right reduce) extends a 2-arity 
function to an n-arity function by composition; an example should 
make this clear. When the optional argument @math{init} isn't defined, we have

@c ===beg===
@c rreduce (f, [1, 2, 3]);
@c rreduce (f, [1, 2, 3, 4]);
@c ===end===
@example
(%i1) rreduce (f, [1, 2, 3]);
(%o1)                     f(1, f(2, 3))
(%i2) rreduce (f, [1, 2, 3, 4]);
(%o2)                  f(1, f(2, f(3, 4)))
@end example

Notice that the function @math{f} is first applied to the rightmost list
elements (thus the name rreduce). When @math{init} is defined, the
second argument to the inner most function 
evaluation is @math{init}; for example

@c ===beg===
@c rreduce (f, [1, 2, 3], 4);
@c ===end===
@example
(%i1) rreduce (f, [1, 2, 3], 4);
(%o1)                  f(1, f(2, f(3, 4)))
@end example

The function @math{rreduce} makes it easy to find the product or
sum of the elements of a list

@c ===beg===
@c rreduce ("+", args (set (a, b)));
@c rreduce ("*", args (set (1, 2, 3, 4, 5)));
@c ===end===
@example
(%i1) rreduce ("+", args (set (a, b)));
(%o1)                         b + a
(%i2) rreduce ("*", args (set (1, 2, 3, 4, 5)));
(%o2)                          120
@end example

See also @math{lreduce}, @math{tree_reduce}, and @math{xreduce}.
@end defun

@anchor{setdifference}
@defun  setdifference (a,b)
Return a set containing the elements in the set @emph{a} that are
not in the set @emph{b}.  Signal an error if @emph{a} or @emph{b} aren't sets.
@end defun

@anchor{setify}
@defun setify (a)
Construct a set from the elements of the list @emph{a}.  Duplicate
elements of the list @emph{a} are deleted and the elements
are sorted according to the predicate @emph{orderlessp}.  
Signal an error if @emph{a} isn't a list. 
@end defun

@anchor{setp}
@defun setp (a)
Return true if and only if @emph{a} is a Maxima set.  The function
@emph{setp} checks that the operator of its argument is set; it doesn't
check that its argument is a @emph{simplified} set. Thus

@c ===beg===
@c setp (set (a, a)), simp: false;
@c ===end===
@example
(%i1) setp (set (a, a)), simp: false;
(%o1)                         true
@end example

The function @emph{setp} could be coded in Maxima as 
@math{setp(a) := is(inpart(a,0) = set)}.

@end defun

@anchor{set_partitions}
@defun set_partitions (a, {n})
When the optional argument @math{n} is defined, return a set of all
decompositions of @math{a} into @math{n} @emph{nonempty} disjoint 
subsets. When @math{n} isn't defined, return the set of all partitions.

We say a set @math{P} is a @emph{partition} of a set @math{S} provided
@enumerate
@item
each member of @math{P} is a nonempty set,
@item
distinct members of @math{P} are disjoint,
@item
the union of the members of @math{P} equals @math{S}.
@end enumerate
The empty set is a partition of itself (the conditions 1 and 2 being
vacuously true); thus

@c ===beg===
@c set_partitions (set ());
@c ===end===
@example
(%i1) set_partitions (set ());
(%o1)                         @{@{@}@}
@end example

A few additional examples

The cardinality of the set of partitions of a set can be found using @emph{stirling2}; thus

@c ===beg===
@c s: set (0, 1, 2, 3, 4, 5)$
@c p: set_partitions (s, 3)$ 
@c cardinality(p) = stirling2 (6, 3);
@c ===end===
@example
(%i1) s: set (0, 1, 2, 3, 4, 5)$
(%i2) p: set_partitions (s, 3)$ 
(%o3)                        90 = 90
(%i4) cardinality(p) = stirling2 (6, 3);
@end example

Each member of @math{p} should have 3 members; let's check

@c ===beg===
@c s: set (0, 1, 2, 3, 4, 5)$
@c p: set_partitions (s, 3)$ 
@c map (cardinality, p);
@c ===end===
@example
(%i1) s: set (0, 1, 2, 3, 4, 5)$
(%i2) p: set_partitions (s, 3)$ 
(%o3)                          @{3@}
(%i4) map (cardinality, p);
@end example

Finally, for each member of @math{p}, the union of its members should 
equal @math{s}; again let's check

@c ===beg===
@c s: set (0, 1, 2, 3, 4, 5)$
@c p: set_partitions (s, 3)$ 
@c map (lambda ([x], apply (union, listify (x))), p);
@c ===end===
@example
(%i1) s: set (0, 1, 2, 3, 4, 5)$
(%i2) p: set_partitions (s, 3)$ 
(%o3)                 @{@{0, 1, 2, 3, 4, 5@}@}
(%i4) map (lambda ([x], apply (union, listify (x))), p);
@end example
@end defun

@anchor{some}
@defun some (f, set(a1,...,an)) or  some(f,[a11,...,a1n],[a21,...],...)

The first argument @math{f} should be a predicate (a function that evaluates to
true, false, or unknown). 

Given one set as the second  argument, 
@math{some(f, set(a1,...,an))} returns @math{true} if any f(ai) evaluates to true.
Since sets are unordered, 'some' is free to evaluate f(ai) in any
order.   'Some' may or may not evaluate all the f(ai)'s. Because the
order of  evaluation isn't specified, the predicate @math{f} should
not have side-effects or signal errors for any input. 
To use  'some' on multiple set arguments, they should first be converted
to an ordered  sequence so that their relative alignment becomes well-defined.

Given one or more lists as arguments,
@math{some(f,[a11,...,a1n],[a21,...],...)} evaluates to true if  any f(ai1,ai2,...)
evaluates to true. 'Some' may or may not evaluate all the
f(ai1,ai2,...)'s.  Since  lists are ordered, 'some' evaluates in the order of increasing 'i'.
If the global flag $maperror is true (the default), all lists 
@math{[a11,..a1n], [a21,..], ...} must have equal lengths -- otherwise, some signals an error.
When the Maxima flag $maperror is false, the list arguments are
effectively truncated each to the length of the shortest list. 

The Maxima function 'is' is automatically applied after evaluating the
predicate @math{f}; thus the following work correctly

@c ===beg===
@c some ("<", [a, b, 5], [1, 2, 8]);
@c some ("=", [2, 3], [2, 7]);
@c ===end===
@example
(%i1) some ("<", [a, b, 5], [1, 2, 8]);
(%o1)                         true
(%i2) some ("=", [2, 3], [2, 7]);
(%o2)                         true
@end example
@end defun

@anchor{stirling1}
@defun stirling1 (n m)
The Stirling number of the first kind.  When @math{n,m} are nonnegative 
integers, the @emph{magnitude} of @math{stirling1(n,m)} is the number of 
permutations of a set with @math{n} members that have @math{m} cycles.
For details, see Graham, Knuth and Patashnik @emph{Concrete Mathematics}.
We use a recursion relation to define @math{stirling1(n,m)} for
@math{m < 0}; we do not extend it for @math{n < 0} or for non-integer
arguments.

The function @math{stirling1} works by simplification; it knows the 
basic special values (see Donald Knuth, @emph{The Art of Computer Programming,}
third edition, Volume 1,  Section 1.2.6, Equations 48, 49, and 50).  
For Maxima to apply these rules, the arguments must be declared to 
be integer and the first argument must nonnegative. Here's an example

@c ===beg===
@c declare (n, integer)$
@c assume (n >= 0)$
@c stirling1 (n, n);
@c ===end===
@example
(%i1) declare (n, integer)$
(%i2) assume (n >= 0)$
(%i3) stirling1 (n, n);
(%o3)                           1
@end example

With a non-integer argument, this simplification isn't made

@c ===beg===
@c stirling1 (sqrt(2), sqrt(2));
@c ===end===
@example
(%i1) stirling1 (sqrt(2), sqrt(2));
(%o1)              stirling1(sqrt(2), sqrt(2))
@end example

Maxima knows a few other special values; for example

@c ===beg===
@c declare (n, integer)$
@c assume (n >= 0)$
@c stirling1 (n + 1, n);
@c stirling1 (n + 1, 1);
@c ===end===
@example
(%i1) declare (n, integer)$
(%i2) assume (n >= 0)$
(%i3) stirling1 (n + 1, n);
                            n (n + 1)
(%o3)                       ---------
                                2
(%i4) stirling1 (n + 1, 1);
(%o4)                          n!
@end example
@end defun

@anchor{stirling2}
@defun stirling2 (n m)
The Stirling number of the second kind. When @math{n,m} are nonnegative 
integers, @math{stirling2(n,m)} is the number of ways a set with 
cardinality @math{n} can be partitioned into @math{m} disjoint subsets.
We use a recursion relation to define @math{stirling2(n,m)} for
@math{m < 0}; we do not extend it for @math{n < 0} or for non-integer
arguments.

The function @math{stirling2} works by simplification; it knows the 
basic special values (see Donald Knuth, @emph{The Art of Computer Programming,}
third edition, Volume 1,  Section 1.2.6, Equations 48, 49, and 50).  
For Maxima to apply these rules, the arguments must be declared to 
be integer and the first argument must nonnegative. Here's an example

@c ===beg===
@c declare (n, integer)$
@c assume (n >= 0)$
@c stirling2 (n, n);
@c ===end===
@example
(%i1) declare (n, integer)$
(%i2) assume (n >= 0)$
(%i3) stirling2 (n, n);
(%o3)                           1
@end example

With a non-integer argument, this simplification isn't made

@c ===beg===
@c stirling2 (%pi, %pi);
@c ===end===
@example
(%i1) stirling2 (%pi, %pi);
(%o1)                  stirling2(%pi, %pi)
@end example

Maxima knows a few other special values; for example

@c ===beg===
@c declare (n, integer)$
@c assume (n >= 0)$
@c stirling2 (n + 9, n + 8);
@c stirling2 (n + 1, 2);
@c ===end===
@example
(%i1) declare (n, integer)$
(%i2) assume (n >= 0)$
(%i3) stirling2 (n + 9, n + 8);
                         (n + 8) (n + 9)
(%o3)                    ---------------
                                2
(%i4) stirling2 (n + 1, 2);
                              n
(%o4)                        2  - 1
@end example
@end defun

@anchor{subset}
@defun subset (a, f)
Return the subset of the set @emph{a} that satisfies the predicate @emph{f}. 
For example

@c ===beg===
@c subset (set (1, 2, x, x + y, z, x + y + z), atom);
@c subset (set (1, 2, 7, 8, 9, 14), evenp);
@c ===end===
@example
(%i1) subset (set (1, 2, x, x + y, z, x + y + z), atom);
(%o1)                     @{1, 2, x, z@}
(%i2) subset (set (1, 2, 7, 8, 9, 14), evenp);
(%o2)                      @{2, 8, 14@}
@end example

The second argument to @emph{subset} must be a Maxima predicate
(a boolean-valued function of one argument) if the first argument to 
@emph{subset} isn't a set, signal an error. See also
@ref{partition_set}.
@end defun

@anchor{subsetp}
@defun subsetp (a, b)
Return true if and only if the set @emph{a} is a subset of @emph{b}.
Signal an error if @emph{a} or @emph{b} aren't sets.
@end defun

@anchor{symmdifference}
@defun symmdifference (a1,a2, ..., an)
Return the set of members that occur in @emph{exactly} one
set @math{ai}. Signal an error if any argument @math{ai} isn't a
set. Given two arguments, @math{symmdifference(a,b)} is
the same as @math{union(setdifference(a,b),setdifference(b,a))}.
@end defun

@c tree_reduce ACCEPTS A SET OR LIST AS AN ARGUMENT, BUT rreduce AND lreduce WANT ONLY LISTS; STRANGE
@anchor{tree_reduce}
@defun tree_reduce (f, s, @{init@})

The function @math{tree_reduce} extends a associative binary operator @math{f : S x
S -> S} from two arguments to any number of arguments using a minimum
depth tree.  An example should make this clear

@c ===beg===
@c tree_reduce (f, [a, b, c, d]);
@c ===end===
@example
(%i1) tree_reduce (f, [a, b, c, d]);
(%o1)                  f(f(a, b), f(c, d))
@end example

Given an odd number of arguments, @math{tree_reduce} ``favors'' the left
side of the tree; for example

@c ===beg===
@c tree_reduce (f, [a, b, c, d, e]);
@c ===end===
@example
(%i1) tree_reduce (f, [a, b, c, d, e]);
(%o1)               f(f(f(a, b), f(c, d)), e)
@end example

For addition of floating point numbers, using @math{tree_reduce} may
give a sum that has a smaller rounding error than using either
@math{rreduce} or @math{lreduce}.
@end defun

@anchor{union}
@defun union (a1,a2, ..., an)
Return the union of the sets @emph{a1} through @emph{an}. 
When @emph{union} receives no arguments, it returns the
empty set. Signal an error when one or more arguments to 
@emph{union} is not a set.
@end defun

@c xreduce ACCEPTS A SET OR LIST AS AN ARGUMENT, BUT rreduce AND lreduce WANT ONLY LISTS; STRANGE
@anchor{xreduce}
@defun xreduce (f, s, @{init@})

This function is similar to both @math{lreduce} and @math{rreduce} except
that @math{xreduce} is free to use either left or right associativity; 
in particular when @math{f} is an associative function and Maxima 
has a built-in evaluator for it, @math{xreduce} may use the nary
function; these nary functions include addition, multiplication, 'and', 'or', 'max',
'min', and 'append'. For these operators, we generally expect
using @math{xreduce} to be faster than using either @math{rreduce} or
@math{lreduce}.  When @math{f} isn't nary, @math{xreduce} uses
left-associativity.

Floating point addition is not associative; nevertheless, @math{xreduce}
uses Maxima's nary addition when the set or list @math{s} contains
floating point numbers.

@end defun







